
label mapmenu:

    think "要去哪裡呢？"

menu:
    
    "學校":

        jump map_school
    
    "公園":

        jump map_park
    
    "商店街":

        jump map_shop
    
    "大街":

        jump map_street


label map_school:

    think """
    
        結果還是還是在學校晃了一下，

        不知不覺就走到淨雨的教室前了， 

        那就跟著淨雨一起回家吧！

        我走到淨雨的班級前面，

        從窗戶看向教室裡的淨雨，
    
        看起來在跟朋友聊天呢，

        慘了，如果他要跟朋友出去玩，我不就礙事了？

        正當我準備離去時，突然跟她的中的一個朋友對上了眼，

        我嘗試使用手語向她表達，

    """
    
    me "妳們，有要，跟淨雨，一起出去，玩嗎？"

    think """
    
        滿分的肢體語言，如此一來她應該能理解吧！

        她好像突然懂了甚麼，並對我露出了一抹壞笑，

        然後轉去跟其他女生交頭接耳，

        不久後她們一起從淨雨的身邊離開了，

        留下一臉茫然的淨雨。

        我試著向她打招呼。

    """

    play music "audio/cheer.mp3"

    me "喂！該走啦！淨雨。"

    miko "喔...喔!"

    think "她彷彿被嚇著似的彈了起來。"

    ##場景街上

    think "在放學黃昏的路上，一邊吹著涼風一邊悠閒地走著也滿愜意的。"

    miko "我是不是被討厭了........"

    think "淨雨一副快哭出來的樣子低著頭嘟囔道。"

    me "不...我想沒有，還有.........抱歉"

    miko "為什麼松君要道歉阿?"
    
    me "嘛...總覺得...很抱歉..."

    think "我是魔鬼阿......"

    stop music fadeout 1.0

    return

label map_park:

    think """
    
        還是來公園散散步放鬆一下心情吧！

        黃昏那溫柔的光線，不偏不倚的落在湖裡，

        溜滑梯上、人行道上、還有汗水上。

    """
    
    me "汗水上...？？"

    who "喝！喝！喝！"

    think "一聲聲規律且渾厚的聲音，刺進了我的耳裡，"

    who "啊啊啊啊啊！！！最後衝刺！！！"

    think "與愜意的黃昏完全不搭的，討人厭的汗臭與過度的激情，完全打消了我散步的興頭。"

    baka "啊...我滴著汗水的肌肉跟溫柔夕陽簡直是絕配啊！哈哈哈！！"

    think "想都不用想，是之東。"

    think "現在最應該避免的是和他......"

    baka "喔！！是松啊！！哈哈！真巧！你也來這裡運動啊！！"

    me "..."

    think "在最不想被搭話的時候，被最不想搭話的人給搭話了...。"

    me "喔...喔......"

    think "我隨意地打發他便想加速離去，"

    baka "等等！松！不來試試我研發的最新肌肉鍛鍊法嗎？"

    me "什...什麼方法..."

    think "我一點也不想知道，但勢必得順著他說他才會放我走吧！"

    baka "叫作..."

    baka "超級重之50kg負重引體向上！！"

    me "哇...顧名思義阿......"
    
    think "..."

    think "他以很厲害的氣勢瞪向我這裡了。"

    baka "盯..."

    me "呃...不是，就算你那樣看著我，我也不會做的喔！"

    baka "{size=36}盯！！！{/size}"

menu:

    think "他以更加強力的眼神看向我了。"

    "硬著頭皮上了！":

        me "硬著頭皮上了！"

        think "畢竟要我辜負他那一身熱血，"

        think "有失身為男人的格調，"

        me "真拿你沒辦法！"

        think """
        
            我把地上的槓片用瑜珈繩綁在身體上，

            身體瞬間增加了50Kg，

            可惡，那傢伙到底是怎麼一回事，竟然能隨身攜帶這些東西，

            我看向頭頂上的單槓，

            感覺似乎比平時高了很多，
        
        """

        me "喔喔喔！！！！！" with hpunch


        think "我原地起跳，雙手差點搆不著單槓。"

        me "哦~~？！喔！！！"

        think "我重新抓緊單槓後，"

        think "再一次全身發力。"

        me "啊啊啊啊啊！！！"

        me "喝！！！"

        think "隨著一聲大吼，我做到了，"

        think "......"

        baka "Good Job！"

        think "東向我豎起大拇指，我也豎起大姆指作為回應，"

        think "果然，男人還是熱血的好啊！！"

        #《獲得成就：50kg引體向上的征服者！》
        $achievement.grant("50kg引體向上的征服者！")
        $renpy.notify("《獲得成就：50kg引體向上的征服者！》")

        think "..."

        think "..."

        think "熱血一冷卻下來後，總感覺自己幹了一件蠢到不行的事啊..."

        return


    "不可能做得來的吧！":

        me "不可能做得來的吧！"

        baka "{size=48}盯！！！{/size}"

        think "可惡...再這麼下去他會突破對話框的..."

        think "得想想辦法才行..."

        think "對了！"

        me "吶！之東！果然真男人之間還是用跑步決勝負吧！"
        
        baka "跑步？"

        think "之東稍微搔了一下頭，似乎不太明白我說的話。"

        me "常常有胸部大的可愛妹子跟我說，用跑步決勝負的男人最帥了！"

        think "雖然有點對不起他，不過也沒辦法，只能這樣了。"
        
        baka "唉...我一直把你當作兄弟的..."

        baka "你卻這樣對我..."

        think "被...被發現了嗎？？！"

        think "難道說其實他出乎意料的挺聰明的？？！"

        baka "真是太過分了！"
        
        baka "有這種事情既然不早說！！！"

        think "阿~抱歉，我錯了，果然他還是一個笨蛋阿..."

        me "抱歉了東，但是既然都要決勝負，就用受妹子們歡迎的跑步來吧！如何？"

        baka "求之不得！"

        me "那誰先追到夕陽誰就獲勝！"

        baka "喔喔喔！！！太熱血了！！"

        me "那...3...2...1..."

        baka "出發！！！"

        think """...

            他想也沒有想便朝著夕陽奔去，

            並在地平線上的某一點上消失了。

            當然我動也沒動，就準備直接回家了。

            抱歉了之東...

        """

        return

label map_shop:

    think "去商店街看看吧"
        
    think "說起來還要幫老媽買魚呢！"

    play music "audio/bgm2.mp3"

    think """     
        到了商店街，突然一個特別突兀的身影映入我的眼簾，

        一對歌德蘿莉站在麵包店的櫥窗前，

        成雙成對的衣服和飾品，看來似乎是對可愛的雙胞胎姊妹，

    """

    eldsis "妹妹呦，這就是所謂的麵包嗎？"

    youngsis "姊姊......這個....看起來.......很好吃。"

    eldsis "妹妹呦，那麼要如何才能得到這個所謂的麵包呢？"

    youngsis "不.....不知道.....可能......要拿什麼東西跟裡面的......那個人類......交換吧？"

    eldsis "嗯.....妹妹呦.....用搶的不行嗎？"

    youngsis "不可以!!知心哥哥會修理我們一頓的，我們不可能瞞得過他的。"

    eldsis "也是呢。"

    think """

        我看著兩個餓著肚子的歌德蘿莉許久。
        
        .......
        
        這對姊妹相當不妙阿
        
        真的相當不妙.............
        
        {size=75}完全激起我的保護欲阿！！！{/size}
        
        我大步往麵包店走去，

    """

    me "老闆，給我兩個甜甜圈。"

    think """
    
        我帥氣的把老媽給我的買魚錢砸在櫃檯上，
    
        抱歉了老媽，但我真的需要這筆錢，
    
        我雙手合十朝著遠方道歉著，
    
    """

    clerk "歡迎再來喔！"

    think """
        
        我拎著兩塊熱騰騰剛出爐的麵包，

        以阿姆斯壯登入月球時的氣勢走向那對姊妹。

        其中一位看起來比較怯弱的妹妹，看我走了過來便躲到了姊姊的後方，
    
    """

    youngsis"姊姊......有怪人過...過來了......！"

    me "哪裡？！哥哥我保護你們！！"

    think "最近商店街附近的治安確實不太好，就讓我來保護這對姊妹吧！"

    eldsis "妹妹呦！別怕！姊姊保護妳！"

    think "兩人狠狠的瞪著我的背後看著。"
    
    me "？！"

    me "不好！難道在我身後嗎？"

    think "我轉了一圈，還是沒發現任何可疑的人影，"

    youngsis "姊姊...這個哥哥在跳著奇怪的舞..."

    eldsis "還不清楚他想幹嘛...先別輕舉妄動..."

    me "唉？"

    think "我與那兩人對視了3秒。"

    me "唉？怪人是我嗎？"

    twin "嗯！"

    think "兩人同時朝著我點頭，"
    
    think "..."

    think "實在有點傷人阿..."

    me "哥哥我啊...可不是什麼壞人喔。"

    think "我緩緩遞出剛買的麵包"

    twin "嗯？"

    think"兩人看了看麵包，又看了看彼此。"

    twin "嗯！"

    think "彼此點了頭之後，各拿一個麵包走了，"

    think "兩人開始吃起了麵包，"

    eldsis "好吃！！妹妹呦！來嚐嚐看姐姐的吧！"

    youngsis "好吃！！那也請姐姐務必嚐嚐我的！"

    think "嘛~都是同樣的麵包就是了，"

    think "看著兩個可愛的小蘿莉吃著麵包，簡直是享受啊..."

    stop music fadeout 1.0
    
    eldsis "哥哥是麵包妖怪嗎？"

    think "雙胞胎姐姐拉了拉我的袖口問道。"

    me "對阿！哥哥就是麵包妖怪喔！"

    think "太...太可愛了...真受不了啊......"

    think "唉？等等..."

    me "妖怪？"

    play music "audio/dream.mp3"

    think "一般來說也會說麵包精靈之類的吧！"

    think "嘛~童言童語吧！"

    eldsis "嗯嗯！哥哥是妖怪吧！"

    think "我吞了口口水，"

    think "不對勁，這股奇妙的違和感..."

    me "太奇怪了..."
    
    think "我小聲得嘟囔著，"

    think"我的身體在告訴我，這對姊妹很危險。"

    youngsis "不奇怪喔..."

    youngsis "姐姐她...很厲害喔！..."

    youngsis "姐姐她能看見喔！..."

    think "唉？聽...聽見了？"

    think "到底怎麼回事？我瞬間毛骨悚然，雙腿發軟。"

    eldsis "妹妹呦，抓他回去怎麼樣？"

    youngsis "姊姊覺得好就好了......"

    think "兩人不斷放出了強大的壓迫感，"
    
    think "我甚至難以呼吸......"
    
    me "可惡..動...動彈不得......"

    think """
        
        兩人慢慢朝我逼近，

        慢慢的...

        已經到了伸出手就可以碰觸到的範圍了
        
        ...

        腳步聲停下來了...

    """

    stop music fadeout 1.0

    me "嗯？"

    think "突然之間，壓迫感也消失了，"

    eldsis "妹妹呦！妳聽到了吧！"

    youngsis "聽到了！是時候該走了呢姊姊..."

    eldsis "也只能這樣了呢...」"
    
    think """
    
        雙胞胎彼此乎看了一眼，然後嘆了一口氣，
    
        將我放著就走了。

        ......

        我雙腳一軟，癱倒在地，試著重新調整呼吸，

    """

    me "剛剛的...到底是..."

    think "我也不敢多想，坐著休息。"

    who "你還好吧..."

    think "一個成熟的聲音從商店街的巷口傳來。"

    me "嘛~還可以。"

    think """
        
        我朝著聲音源頭望去，
        
        一名皮膚白皙、五官立體的男子，
    
        有著就算說是模特兒我也相信的顏值，
        
        他深邃的眼眸注視著剛剛雙胞胎離開的方向。

    """

    who "來晚了...都是貓的錯..."

    me "什...什麼？"

    think """

        男子丟下了不明所以的話語便離去了，
        
        ......
        
        10分鐘過去了，
        
        身體差不多可以活動了，
        
        只是身體仍然止不住顫抖，
        
        那就是瀕臨死亡的恐懼感嗎？...
        
        我站了起來，跌跌撞撞的走向家的方向。
    
    """

    return

label map_street:

    think """
        
        果然還是走在大街上感覺最舒適，
    
        夕陽斜斜的照在湖裡，湖裡也溫柔的倒映著夕陽，
    
        涼風徐徐吹過，湖面便閃閃發亮，

    """

    me "也快夏天了呢。"

    think "我愜意的往家的方向走著，"

    think "突然有東西吸引了我的目光。"

    me "那個是..."

    think """
    
        似乎是一隻小小的流浪貓，
    
        有人正在跟他玩啊，
    
        我也想撸貓看看阿...
    
        我緩緩走向那名男子，

    """

    play music "audio/cheer.mp3"

    me "我也能摸摸牠嗎？"

    think "說完我便將手伸向貓。"

    think "「呷！！！」"

    think "在我快碰到貓的瞬間，那隻貓突然伸長爪子，"

    think "朝我的手抓了一下，"

    me "痛..痛....."

    think "留下爪痕了..."

    think "明天拿去騙之東說這是和獅子決鬥時留下的疤看看，"

    think "一定很好玩。"

    man "你...太不成熟了......"

    think "男子冷不防的發言，"

    think "說完他緩緩地站了起來，"

    man "下次想碰貓之前，先奉上兩個罐罐之後再說吧！"

    think """

        男子轉過身來，
        
        那是一名皮膚白皙、五官立體的男子，
    
        有著就算說是模特兒我也相信的顏值，
        
        正以貓奴的身姿與我對峙著。

    """

    me "我...我下次會注意的......"

    think "男子點了頭，不發一語的走了。"

    think "那個人是怎麼一回事？？"

    stop music fadeout 1.0
    
    return
