
label chap2_1:

    scene bg room
    with fade

    think """
    
        哭阿早上了???要遲到啦!!遲到嗎....

        要不乾脆不去上課吧

        得不被老媽發現才行

        乾淨的騙過老媽吧

        抱歉了老媽

        但我真的需要那個酷東西
    
    """
    
    scene bg tree
    with fade

    mother "阿拉~阿拉~松君，今天比平時晚一點呢"

    think """
    
        在妖界很難從環境的變化看出時間

        實際上我大概晚了3小時左右

        也許是老媽剛好沒看錶吧

    """

    me "是阿，不過快一點應該來得及"

    think "我一邊說，一邊把桌上的麵包咬在嘴裡"

    me "我出發了~"

    mother "阿對了記得幫我買點魚回來"

    me "好~"

    scene bg pond 
    with fade
    
    think """
    
        坐在池塘邊悠閒地吃著麵包

        畢竟就這樣跳進去麵包就喂魚了

        既然決定翹課了，那麼要去哪兒呢?
    
    """

    jump skipclass

label chap2_2:

    scene bg black

    think "按掉鬧鐘"

    scene bg room
    with fade

    think """        

        窗外是一片明媚.........才怪

        妖界的天空是一直都是紅色的，只有月亮的圓缺會隨著日期變化

        雖然已經習慣了，但我還蠻嚮往被太陽曬屁股的感覺

        換好衣服
        
        """

    mother "吃早飯喔~"

    scene bg tree
    with fade

    think """
    
        餐桌上有正常的烤土司和煎蛋，以及看起來像紫色大香腸，但是不停冒出黏液和紅色蒸氣的食物，看起來是給老爸吃的

        我把吐司蛋匆匆吃完便出門了
        
        我把制服放進防水袋裡面
    
    """

    me "那我去上學拉"

    mother "走好~"

    mother "阿對了記得幫我買點魚回來"

    me "好~"

    scene bg pond
    with fade

    think """
    
        跳進後院的池子裡
        
        雖然說已經習慣了，但說真的有夠不方便，找個時間解決這個問題吧

        在一陣奇幻的穿越感後，來到了人界
    
        正準備在池塘邊換上制服時
    
    """

    miko "呼呼呼~真是~何等的養眼"

    me "阿！靜雨，你什麼時候在這裡？"

    think "眼前的是一個黑髮及腰的美少女，我的老相識，許靜雨"

    think "她雖然是神社的巫女，但是個性有失一個女巫該有的樣子..."

    miko "嗯.....大概是從松君把右腳穿進內褲的時候"

    think "心理鬆了一口氣，起碼沒有看到我從池塘爬出來的樣子"

    me "那不是幾乎全部看光了嗎?"

    me "可惡嫁不出去了"

    miko "那我可以娶你"

    me "...."

    think "我懶得吐槽了，走吧，上學去"

    miko "阿拉~我可是相當認真的呢？"

    miko "但是....說起來為什麼松君會從池子裡跑出來呢？"

menu:

    think "doki~！！！還是被發現了，我是半妖的是絕對不能被一般人發現，個何光靜雨她是女巫，我有可能會被她祓除(物理)"

    "糊弄過去":

        me "對了，今天天氣真好"

        miko "對阿~真是好天氣呢"

        me "..."

        miko "..."

        me "..."

        miko "..."

        miko "你覺得我會被這種昭和時代的轉移話題技巧乎弄過去嗎?"

        think "可惡，剛出廠就面臨重大難關阿..."

        jump chap2_2_explain

    "逃跑":

        me "對了，今天天氣真好"
        
        miko "對阿~真是好天氣呢"

        me "..."

        miko "..."

        me "..."

        miko "..."

        think "我突然往上看，裝作看到天上有東西在飛"

        think "靜雨隨著我的視線看過去"

        me "幹飛碟！！？？"

        think """
        
            我浮誇的指向天空一無所有的地方叫著

            我突然拔腿就跑

            結果被靜雨伸腳絆倒了
        
        """

        me "可惡，失敗了"

        miko "你以為我會被這種經典迷因騙到嗎？"

        jump chap2_2_explain

    "使出全力逃跑":

        think "可惡沒辦法了，雖然用那個會頭痛，但比起祕密被發現，只能這麼做了"

        me "抱歉，我臨時想到急事"

        think """
        
            雖然實在不想這麼做

            但為了避免麻煩的事態發生

            我深吸一口氣，屏住呼吸

            試著保持高度專注

            從心臟開始，慢慢的想像血液流動到腳尖的樣子，

            然後慢慢吐氣，

            """

        me "差不多了"

        think """
            
            往地上猛的一蹬，

            大概在她眼裡我就只是突然消失了吧！

            留下一臉茫然的靜雨

            呼，停下來後，頭痛感湧了上來

            稍作休息後

            我尋思著接下來去哪裡比較好

            去學校還是會遇到靜雨

            不如去哪裡逛逛吧
        
        """

        jump skipclass

label chap2_2_explain:

    miko "所以呢？到底是為什麼"

    me "說來你可能不信，我其實是去抓魚"

    miko "抓魚..."

    me "......"

    miko "走吧~上學要遲到了"

    think "我默默在心裡感謝淨雨"
